# DATA WAREHOUSES AND ASSOCIATION RULES (Part A)

### Part A: Datawarehouse

- Port Number PostgreSQL: 5433
- Password: kilberryshake

#### Q1 Data Cube

In [3]:
import pandas as pd

In [7]:
df = pd.read_csv("DW_dataset.csv")
df.head()

,Employee ID,Name,Date of Birth,Gender,Job Title,Salary,Date Joined,Date Left,Address
0,100,Smith,12-Jan-74,M,Director,50000,01-Aug-01,NaN,"12, Green Avenue, Howth, Co. Dublin"
1,125,Jones,06-Apr-89,F,Technician,40000,01-May-01,31-Aug-02,"43, School Road, Malahide, Co. Dublin"
2,167,Davis,19-Jan-82,F,Senior Technician,50000,01-Dec-02,NaN,"10, Main Street, Naas, Co. Kildare"
3,200,O'Bien,03-May-97,M,Technician,25000,01-May-02,30-Nov-02,"Apt 02, High Court, Condalkin. Co. Dublin"
4,205,Edward,16-Nov-95,M,Technician,33000,01-Jan-01,NaN,"33, Barake Street, Clane, Co. Kildare"

In [8]:
df['Job Title'] = df['Job Title'].str.strip() 
df['Gender'] = df['Gender'].str.strip() 
df[['Address', 'County']] = df["Address"].str.split(r"\bCo\b", expand=True) 
df['County']=df['County'].str.replace(r'.',"", regex=True) 
df['Date of Birth'] =  pd.to_datetime(df['Date of Birth'], infer_datetime_format=True) 
df['Date Joined'] =  pd.to_datetime(df['Date Joined'], infer_datetime_format=True) 
df['Date Left'] =  pd.to_datetime(df['Date Left'], infer_datetime_format=True) 
 
def getJobCategory(x): 
    y = x.split(' '); 
    if 'Technician' in y: 
        return 'Technical' 
    elif 'Director' in y: 
        return 'Management' 
    elif 'Manager' in y: 
        return 'Management' 
 
df['Job Category'] = df["Job Title"].apply(getJobCategory) 
df = df.drop(['Address', 'Job Title'], axis=1)
df.head()

,Employee ID,Name,Date of Birth,Gender,Salary,Date Joined,Date Left,County,Job Category
0,100,Smith,1974-01-12,M,50000,2001-08-01,NaT,Dublin,Management
1,125,Jones,1989-04-06,F,40000,2001-05-01,2002-08-31,Dublin,Technical
2,167,Davis,1982-01-19,F,50000,2002-12-01,NaT,Kildare,Technical
3,200,O'Bien,1997-05-03,M,25000,2002-05-01,2002-11-30,Dublin,Technical
4,205,Edward,1995-11-16,M,33000,2001-01-01,NaT,Kildare,Technical

In [ ]:
engine = db.create_engine('postgresql://PGusername:PGpass@localhost:port/DBname')